GopalSaraf/Practicals/PSDL/include/proc/pic16lf18325.inc
// Register: NCO1ACCL
#define NCO1ACCL NCO1ACCL
NCO1ACCL                                 equ 0498h
// bitfield definitions
NCO1ACCL_NCO1ACC_POSN                    equ 0000h
NCO1ACCL_NCO1ACC_POSITION                equ 0000h
NCO1ACCL_NCO1ACC_SIZE                    equ 0008h
NCO1ACCL_NCO1ACC_LENGTH                  equ 0008h
NCO1ACCL_NCO1ACC_MASK                    equ 00FFh

// Register: NCO1ACCH
#define NCO1ACCH NCO1ACCH
NCO1ACCH                                 equ 0499h
// bitfield definitions
NCO1ACCH_NCO1ACC_POSN                    equ 0000h
NCO1ACCH_NCO1ACC_POSITION                equ 0000h
NCO1ACCH_NCO1ACC_SIZE                    equ 0008h
NCO1ACCH_NCO1ACC_LENGTH                  equ 0008h
NCO1ACCH_NCO1ACC_MASK                    equ 00FFh

// Register: NCO1ACCU
#define NCO1ACCU NCO1ACCU
NCO1ACCU                                 equ 049Ah
// bitfield definitions
NCO1ACCU_NCO1ACC_POSN                    equ 0000h
NCO1ACCU_NCO1ACC_POSITION                equ 0000h
NCO1ACCU_NCO1ACC_SIZE                    equ 0004h
NCO1ACCU_NCO1ACC_LENGTH                  equ 0004h
NCO1ACCU_NCO1ACC_MASK                    equ 000Fh

// Register: NCO1INCL
#define NCO1INCL NCO1INCL
NCO1INCL                                 equ 049Bh
// bitfield definitions
NCO1INCL_NCO1INC_POSN                    equ 0000h
NCO1INCL_NCO1INC_POSITION                equ 0000h
NCO1INCL_NCO1INC_SIZE                    equ 0008h
NCO1INCL_NCO1INC_LENGTH                  equ 0008h
NCO1INCL_NCO1INC_MASK                    equ 00FFh

// Register: NCO1INCH
#define NCO1INCH NCO1INCH
NCO1INCH                                 equ 049Ch
// bitfield definitions
NCO1INCH_NCO1INC_POSN                    equ 0000h
NCO1INCH_NCO1INC_POSITION                equ 0000h
NCO1INCH_NCO1INC_SIZE                    equ 0008h
NCO1INCH_NCO1INC_LENGTH                  equ 0008h
NCO1INCH_NCO1INC_MASK                    equ 00FFh

// Register: NCO1INCU
#define NCO1INCU NCO1INCU
NCO1INCU                                 equ 049Dh
// bitfield definitions
NCO1INCU_NCO1INC_POSN                    equ 0000h
NCO1INCU_NCO1INC_POSITION                equ 0000h
NCO1INCU_NCO1INC_SIZE                    equ 0004h
NCO1INCU_NCO1INC_LENGTH                  equ 0004h
NCO1INCU_NCO1INC_MASK                    equ 000Fh

// Register: NCO1CON
#define NCO1CON NCO1CON
NCO1CON                                  equ 049Eh
// bitfield definitions
NCO1CON_N1PFM_POSN                       equ 0000h
NCO1CON_N1PFM_POSITION                   equ 0000h
NCO1CON_N1PFM_SIZE                       equ 0001h
NCO1CON_N1PFM_LENGTH                     equ 0001h
NCO1CON_N1PFM_MASK                       equ 0001h
NCO1CON_N1POL_POSN                       equ 0004h
NCO1CON_N1POL_POSITION                   equ 0004h
NCO1CON_N1POL_SIZE                       equ 0001h
NCO1CON_N1POL_LENGTH                     equ 0001h
NCO1CON_N1POL_MASK                       equ 0010h
NCO1CON_N1OUT_POSN                       equ 0005h
NCO1CON_N1OUT_POSITION                   equ 0005h
NCO1CON_N1OUT_SIZE                       equ 0001h
NCO1CON_N1OUT_LENGTH                     equ 0001h
NCO1CON_N1OUT_MASK                       equ 0020h
NCO1CON_N1EN_POSN                        equ 0007h
NCO1CON_N1EN_POSITION                    equ 0007h
NCO1CON_N1EN_SIZE                        equ 0001h
NCO1CON_N1EN_LENGTH                      equ 0001h
NCO1CON_N1EN_MASK                        equ 0080h

// Register: NCO1CLK
#define NCO1CLK NCO1CLK
NCO1CLK                                  equ 049Fh
// bitfield definitions
NCO1CLK_N1CKS_POSN                       equ 0000h
NCO1CLK_N1CKS_POSITION                   equ 0000h
NCO1CLK_N1CKS_SIZE                       equ 0002h
NCO1CLK_N1CKS_LENGTH                     equ 0002h
NCO1CLK_N1CKS_MASK                       equ 0003h
NCO1CLK_N1PWS_POSN                       equ 0005h
NCO1CLK_N1PWS_POSITION                   equ 0005h
NCO1CLK_N1PWS_SIZE                       equ 0003h
NCO1CLK_N1PWS_LENGTH                     equ 0003h
NCO1CLK_N1PWS_MASK                       equ 00E0h

// Register: PWM5DCL
#define PWM5DCL PWM5DCL
PWM5DCL                                  equ 0617h
// bitfield definitions
PWM5DCL_PWM5DCL_POSN                     equ 0006h
PWM5DCL_PWM5DCL_POSITION                 equ 0006h
PWM5DCL_PWM5DCL_SIZE                     equ 0002h
PWM5DCL_PWM5DCL_LENGTH                   equ 0002h
PWM5DCL_PWM5DCL_MASK                     equ 00C0h
PWM5DCL_PWM5DCL0_POSN                    equ 0006h
PWM5DCL_PWM5DCL0_POSITION                equ 0006h
PWM5DCL_PWM5DCL0_SIZE                    equ 0001h
PWM5DCL_PWM5DCL0_LENGTH                  equ 0001h
PWM5DCL_PWM5DCL0_MASK                    equ 0040h
PWM5DCL_PWM5DCL1_POSN                    equ 0007h
PWM5DCL_PWM5DCL1_POSITION                equ 0007h
PWM5DCL_PWM5DCL1_SIZE                    equ 0001h
PWM5DCL_PWM5DCL1_LENGTH                  equ 0001h
PWM5DCL_PWM5DCL1_MASK                    equ 0080h

// Register: PWM5DCH
#define PWM5DCH PWM5DCH
PWM5DCH                                  equ 0618h
// bitfield definitions
PWM5DCH_PWM5DCH_POSN                     equ 0000h
PWM5DCH_PWM5DCH_POSITION                 equ 0000h
PWM5DCH_PWM5DCH_SIZE                     equ 0008h
PWM5DCH_PWM5DCH_LENGTH                   equ 0008h
PWM5DCH_PWM5DCH_MASK                     equ 00FFh
PWM5DCH_PWM5DCH0_POSN                    equ 0000h
PWM5DCH_PWM5DCH0_POSITION                equ 0000h
PWM5DCH_PWM5DCH0_SIZE                    equ 0001h
PWM5DCH_PWM5DCH0_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH0_MASK                    equ 0001h
PWM5DCH_PWM5DCH1_POSN                    equ 0001h
PWM5DCH_PWM5DCH1_POSITION                equ 0001h
PWM5DCH_PWM5DCH1_SIZE                    equ 0001h
PWM5DCH_PWM5DCH1_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH1_MASK                    equ 0002h
PWM5DCH_PWM5DCH2_POSN                    equ 0002h
PWM5DCH_PWM5DCH2_POSITION                equ 0002h
PWM5DCH_PWM5DCH2_SIZE                    equ 0001h
PWM5DCH_PWM5DCH2_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH2_MASK                    equ 0004h
PWM5DCH_PWM5DCH3_POSN                    equ 0003h
PWM5DCH_PWM5DCH3_POSITION                equ 0003h
PWM5DCH_PWM5DCH3_SIZE                    equ 0001h
PWM5DCH_PWM5DCH3_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH3_MASK                    equ 0008h
PWM5DCH_PWM5DCH4_POSN                    equ 0004h
PWM5DCH_PWM5DCH4_POSITION                equ 0004h
PWM5DCH_PWM5DCH4_SIZE                    equ 0001h
PWM5DCH_PWM5DCH4_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH4_MASK                    equ 0010h
PWM5DCH_PWM5DCH5_POSN                    equ 0005h
PWM5DCH_PWM5DCH5_POSITION                equ 0005h
PWM5DCH_PWM5DCH5_SIZE                    equ 0001h
PWM5DCH_PWM5DCH5_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH5_MASK                    equ 0020h
PWM5DCH_PWM5DCH6_POSN                    equ 0006h
PWM5DCH_PWM5DCH6_POSITION                equ 0006h
PWM5DCH_PWM5DCH6_SIZE                    equ 0001h
PWM5DCH_PWM5DCH6_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH6_MASK                    equ 0040h
PWM5DCH_PWM5DCH7_POSN                    equ 0007h
PWM5DCH_PWM5DCH7_POSITION                equ 0007h
PWM5DCH_PWM5DCH7_SIZE                    equ 0001h
PWM5DCH_PWM5DCH7_LENGTH                  equ 0001h
PWM5DCH_PWM5DCH7_MASK                    equ 0080h

// Register: PWM5CON
#define PWM5CON PWM5CON
PWM5CON                                  equ 0619h
// bitfield definitions
PWM5CON_PWM5POL_POSN                     equ 0004h
PWM5CON_PWM5POL_POSITION                 equ 0004h
PWM5CON_PWM5POL_SIZE                     equ 0001h
PWM5CON_PWM5POL_LENGTH                   equ 0001h
PWM5CON_PWM5POL_MASK                     equ 0010h
PWM5CON_PWM5OUT_POSN                     equ 0005h
PWM5CON_PWM5OUT_POSITION                 equ 0005h
PWM5CON_PWM5OUT_SIZE                     equ 0001h
PWM5CON_PWM5OUT_LENGTH                   equ 0001h
PWM5CON_PWM5OUT_MASK                     equ 0020h
PWM5CON_PWM5EN_POSN                      equ 0007h
PWM5CON_PWM5EN_POSITION                  equ 0007h
PWM5CON_PWM5EN_SIZE                      equ 0001h
PWM5CON_PWM5EN_LENGTH                    equ 0001h
PWM5CON_PWM5EN_MASK                      equ 0080h

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
PWM6DCL                                  equ 061Ah
// bitfield definitions
PWM6DCL_PWM6DCL_POSN                     equ 0006h
PWM6DCL_PWM6DCL_POSITION                 equ 0006h
PWM6DCL_PWM6DCL_SIZE                     equ 0002h
PWM6DCL_PWM6DCL_LENGTH                   equ 0002h
PWM6DCL_PWM6DCL_MASK                     equ 00C0h
PWM6DCL_PWM6DCL0_POSN                    equ 0006h
PWM6DCL_PWM6DCL0_POSITION                equ 0006h
PWM6DCL_PWM6DCL0_SIZE                    equ 0001h
PWM6DCL_PWM6DCL0_LENGTH                  equ 0001h
PWM6DCL_PWM6DCL0_MASK                    equ 0040h
PWM6DCL_PWM6DCL1_POSN                    equ 0007h
PWM6DCL_PWM6DCL1_POSITION                equ 0007h
PWM6DCL_PWM6DCL1_SIZE                    equ 0001h
PWM6DCL_PWM6DCL1_LENGTH                  equ 0001h
PWM6DCL_PWM6DCL1_MASK                    equ 0080h

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
PWM6DCH                                  equ 061Bh
// bitfield definitions
PWM6DCH_PWM6DCH_POSN                     equ 0000h
PWM6DCH_PWM6DCH_POSITION                 equ 0000h
PWM6DCH_PWM6DCH_SIZE                     equ 0008h
PWM6DCH_PWM6DCH_LENGTH                   equ 0008h
PWM6DCH_PWM6DCH_MASK                     equ 00FFh
PWM6DCH_PWM6DCH0_POSN                    equ 0000h
PWM6DCH_PWM6DCH0_POSITION                equ 0000h
PWM6DCH_PWM6DCH0_SIZE                    equ 0001h
PWM6DCH_PWM6DCH0_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH0_MASK                    equ 0001h
PWM6DCH_PWM6DCH1_POSN                    equ 0001h
PWM6DCH_PWM6DCH1_POSITION                equ 0001h
PWM6DCH_PWM6DCH1_SIZE                    equ 0001h
PWM6DCH_PWM6DCH1_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH1_MASK                    equ 0002h
PWM6DCH_PWM6DCH2_POSN                    equ 0002h
PWM6DCH_PWM6DCH2_POSITION                equ 0002h
PWM6DCH_PWM6DCH2_SIZE                    equ 0001h
PWM6DCH_PWM6DCH2_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH2_MASK                    equ 0004h
PWM6DCH_PWM6DCH3_POSN                    equ 0003h
PWM6DCH_PWM6DCH3_POSITION                equ 0003h
PWM6DCH_PWM6DCH3_SIZE                    equ 0001h
PWM6DCH_PWM6DCH3_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH3_MASK                    equ 0008h
PWM6DCH_PWM6DCH4_POSN                    equ 0004h
PWM6DCH_PWM6DCH4_POSITION                equ 0004h
PWM6DCH_PWM6DCH4_SIZE                    equ 0001h
PWM6DCH_PWM6DCH4_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH4_MASK                    equ 0010h
PWM6DCH_PWM6DCH5_POSN                    equ 0005h
PWM6DCH_PWM6DCH5_POSITION                equ 0005h
PWM6DCH_PWM6DCH5_SIZE                    equ 0001h
PWM6DCH_PWM6DCH5_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH5_MASK                    equ 0020h
PWM6DCH_PWM6DCH6_POSN                    equ 0006h
PWM6DCH_PWM6DCH6_POSITION                equ 0006h
PWM6DCH_PWM6DCH6_SIZE                    equ 0001h
PWM6DCH_PWM6DCH6_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH6_MASK                    equ 0040h
PWM6DCH_PWM6DCH7_POSN                    equ 0007h
PWM6DCH_PWM6DCH7_POSITION                equ 0007h
PWM6DCH_PWM6DCH7_SIZE                    equ 0001h
PWM6DCH_PWM6DCH7_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH7_MASK                    equ 0080h

// Register: PWM6CON
#define PWM6CON PWM6CON
PWM6CON                                  equ 061Ch
// bitfield definitions
PWM6CON_PWM6POL_POSN                     equ 0004h
PWM6CON_PWM6POL_POSITION                 equ 0004h
PWM6CON_PWM6POL_SIZE                     equ 0001h
PWM6CON_PWM6POL_LENGTH                   equ 0001h
PWM6CON_PWM6POL_MASK                     equ 0010h
PWM6CON_PWM6OUT_POSN                     equ 0005h
PWM6CON_PWM6OUT_POSITION                 equ 0005h
PWM6CON_PWM6OUT_SIZE                     equ 0001h
PWM6CON_PWM6OUT_LENGTH                   equ 0001h
PWM6CON_PWM6OUT_MASK                     equ 0020h
PWM6CON_PWM6EN_POSN                      equ 0007h
PWM6CON_PWM6EN_POSITION                  equ 0007h
PWM6CON_PWM6EN_SIZE                      equ 0001h
PWM6CON_PWM6EN_LENGTH                    equ 0001h
PWM6CON_PWM6EN_MASK                      equ 0080h

